[
    {
        "handle": "@geoguessr\n·\n4h",
        "text": "22 NEW PLAYERS HAVE ENTERED THE ESPORTS SCENE!  \n\nPlease give a WARM WELCOME to the new players that fought tooth and nail in the World League Qualifiers to claim the last 22 spots in the 2026 edition of the WORLD LEAGUE \n\nStarting January 18th on Twitch & YouTube!\n\nStay tuned",
        "timestamp": "2025-12-18T10:00:10.754100"
    },
    {
        "handle": "@FR0STECH\n·\nDec 5",
        "text": "felt miserable so I bought a Greek road sign. Now gonna place it in England to make GeoGuessr Players Miserable",
        "timestamp": "2025-12-18T10:00:10.772139"
    },
    {
        "handle": "@FreedomNoTerror",
        "text": "This is their story.",
        "timestamp": "2025-12-18T10:00:10.790723"
    },
    {
        "handle": "@em000ly\n·\nDec 15",
        "text": "Some of my favorite finds from hours of playing geoguessr",
        "timestamp": "2025-12-18T10:00:10.808444"
    },
    {
        "handle": "@liftsundiet\n·\n9h",
        "text": "Historically. Geoguessr India coverage has been referred to as “Shit Cam” due to the poor camera quality. Google recently added new coverage with an improved camera and the smog still makes every look hazy. Forever Shit Cam",
        "timestamp": "2025-12-18T10:00:12.428006"
    },
    {
        "handle": "@GeoSeeer\n·\nDec 16",
        "text": "We're planning to play some solo games of GeoGuessr using GeoSeer.\nDidn't know everything in game cost money now.",
        "timestamp": "2025-12-18T10:00:12.445016"
    },
    {
        "handle": "@cavempty_\n·\n6m",
        "text": "im like the geoguessr guy but for colors. show me any color and i can tell you what color it is",
        "timestamp": "2025-12-18T10:00:14.561233"
    },
    {
        "handle": "@Radiant_app",
        "text": "Radiant is a free Mac app that captures your meetings without a bot, then drafts your notes, summaries, and next steps.",
        "timestamp": "2025-12-18T10:00:14.577455"
    },
    {
        "handle": "@OneTonUpton\n·\nDec 15",
        "text": "Reached Master 2 in Ranked GeoGuessr!!\n\nThis is going to look great on my dating profile ",
        "timestamp": "2025-12-18T10:00:14.594409"
    },
    {
        "handle": "@ShoMizuba\n·\n47m",
        "text": "【GeoGuessr World League 2026 Participants Announced】  \nThe 22 players who advanced through the World League qualifiers have been announced.  \nFrom Japan, player Shiyoe is making their debut appearance!  \nOthers include strong contenders such as Trichter33 and Malfunctionn who",
        "timestamp": "2025-12-18T10:00:16.600360"
    },
    {
        "handle": "@the_photino\n·\n1h",
        "text": "Was abit tired of geoguessr, so I made \nhttp://\ngeoriddles.com . Its free, see if you can solve riddles and find the items on the map.  Would love to here some feedback.",
        "timestamp": "2025-12-18T10:00:16.618799"
    }
]