[
    {
        "handle": "@LePapillonBlu2\n·\nDec 17",
        "text": "Who else still supports Jack Smith prosecuting Donald Trump? ",
        "timestamp": "2025-12-19T14:00:46.716782"
    },
    {
        "handle": "@LePapillonBlu2\n·\nDec 18",
        "text": "Do you agree that Jack Smith should make everything he has on Donald Trump public, even if it ends Trump’s presidency and sends him to prison?",
        "timestamp": "2025-12-19T14:00:46.737017"
    },
    {
        "handle": "@mjfree\n·\n6h",
        "text": " DO NOT BE DISTRACTED & STAY LOUD!!\n DONALD TRUMP IS GOING DOWN!!\n\nTRUMP & EPSTEIN ARE SEX TRAFFICKERS!!! I’m gonna post this every day so nobody forgets exactly who Pedophile Trump is and why the Epstein files have suddenly disappeared. ",
        "timestamp": "2025-12-19T14:00:46.755775"
    },
    {
        "handle": "@RedLineReportt\n·\nDec 17",
        "text": "BREAKING: Actor Michael Shannon on Donald Trump: “He’s an idiot. He’s a total idiot. He’s not my president. I will never call him the President of the United States.”\n\nWhat’s your response to him...??",
        "timestamp": "2025-12-19T14:00:46.773763"
    },
    {
        "handle": "@BarackObama\n·\nOct 28, 2024",
        "text": "I often hear folks say, “Donald Trump sent me a check during the pandemic.”\n\nI want to make sure you understand this: Congress sent you a check. By the way, Joe Biden also sent you a check during the pandemic, just like I gave people relief during the Great Recession. The",
        "timestamp": "2025-12-19T14:00:49.235121"
    },
    {
        "handle": "@LePapillonBlu2\n·\n19h",
        "text": "After his death, Germany removed all monuments to Hitler and removed his name from any buildings where it appeared.\n\nThis is exactly what’s gonna happen after Donald Trump’s gone!",
        "timestamp": "2025-12-19T14:00:52.194375"
    },
    {
        "handle": "@hoodg3nius\n·\nDec 17",
        "text": "Fuck you donald Trump",
        "timestamp": "2025-12-19T14:00:52.211417"
    },
    {
        "handle": "@WhiteHouse\n·\n22h",
        "text": "President Donald J. Trump signs an Executive Order rescheduling marijuana from Schedule I to Schedule III — recognizing legitimate medical uses and expanding medical marijuana and cannabidiol research to better support patients and doctors.",
        "timestamp": "2025-12-19T14:00:52.229836"
    },
    {
        "handle": "@LePapillonBlu2\n·\nDec 17",
        "text": "This is just one of the many posts I’ve been seeing online about Donald Trump since yesterday.",
        "timestamp": "2025-12-19T14:00:52.246511"
    },
    {
        "handle": "@harryjsisson\n·\nDec 15",
        "text": "Donald Trump is a disturbed, sick, narcissistic, evil, sack of shit. Rob Reiner was a better man than he’ll ever be.",
        "timestamp": "2025-12-19T14:00:54.660575"
    },
    {
        "handle": "@DeathMetalV\n·\nDec 18",
        "text": "Dan Bongino, a massive Trump  supporter went to the FBI promising to expose all the Epstein Files, saw Donald Trump's name ALL over them, changed his tune regarding them, never once exposed anything on them, then quit.\n\nLegendary fucking moron.",
        "timestamp": "2025-12-19T14:00:57.257882"
    },
    {
        "handle": "@ArtCandee\n·\nDec 15",
        "text": "Donald Trump is trash for this post about Rob Reiner.\n\nThen again, he’s always trash.",
        "timestamp": "2025-12-19T14:00:59.841553"
    },
    {
        "handle": "@daviddunn177\n·\nDec 18",
        "text": "Tina Davis was a 14 year old model who was told to “dress sexy” & went to Mar-a-Lago with her mother in 1994.\n\nDonald Trump’s wife, Marla Maples, told the 14 year old’s mother:\n\n“Whatever you do, do not let her around any of these men, and especially my husband. Protect her.”",
        "timestamp": "2025-12-19T14:00:59.858555"
    },
    {
        "handle": "@DemocraticWins\n·\n19h",
        "text": "BREAKING: President Biden was spotted out with his family today looking 1,000 times better than Donald Trump who could barely stay awake during his meetings today. This is amazing.",
        "timestamp": "2025-12-19T14:01:02.099770"
    },
    {
        "handle": "@SaveAmericaNew\n·\nDec 17",
        "text": "BREAKING: Would you support Donald Trump declaring the World Economic Forum a \"Terrorist Organization\" ?\n\nYES or NO?",
        "timestamp": "2025-12-19T14:01:02.120817"
    },
    {
        "handle": "@DisavowTrump20\n·\nDec 17",
        "text": "NEW: Donald Trump has installed a plaque with racist messaging under President Obama's official photograph in the White House. This comes after he earlier removed President Obama's official portrait from the White House.\n\nRETWEET if you stand with President Obama against Trump!",
        "timestamp": "2025-12-19T14:01:03.832306"
    },
    {
        "handle": "@donkoclock\n·\n5h",
        "text": "Donald Trump is FREAKING out over the Epstein Files Release today.  \n\nDO NOT SHARE ! \n@POTUS\n wants no one to see this.",
        "timestamp": "2025-12-19T14:01:06.440920"
    },
    {
        "handle": "@TRUMP_ARMY_\n·\n8h",
        "text": "Give me a Thumbs Up , If YOU SUPPORT AMERICAN PRESIDENT DONALD TRUMP MORE THAN EVER BEFORE!",
        "timestamp": "2025-12-19T14:01:06.463054"
    },
    {
        "handle": "@ArtCandee\n·\nDec 13",
        "text": "Donald Trump even flips a coin like a total loser.",
        "timestamp": "2025-12-19T14:01:06.482192"
    },
    {
        "handle": "@cwebbonline\n·\n2h",
        "text": "Wow The Kennedy Center already started slapping Donald Trump’s name on the building without congressional approval.\n\nThe narcissism is unreal with this man, and the willingness of so many to bend to his every whim is pathetic.",
        "timestamp": "2025-12-19T14:01:08.495299"
    },
    {
        "handle": "@NotAvgLiberal\n·\nDec 17",
        "text": "Minneapolis Police Chief Brian O’Hara just told ICE, that Bitch Kristi Noem, and Donald Trump to Fuck Off.\n\nWe need more of this.",
        "timestamp": "2025-12-19T14:01:08.511139"
    },
    {
        "handle": "@ImtiazMadmood\n·\n23h",
        "text": "Donald Trump finally came out and said it, America and the world must stand against Islam\n\n“All nations must stand together against the evil forces of radical Islamic terrorism, and we're doing that.”\n\nWestern Nations will all fall to Muslims unless drastic action is taken.\n\n-",
        "timestamp": "2025-12-19T14:01:10.401525"
    },
    {
        "handle": "@Maga_Trigger\n·\nDec 16",
        "text": "Show of  if you support the impeachment and removal of Donald Trump!",
        "timestamp": "2025-12-19T14:01:12.533606"
    },
    {
        "handle": "@ReallyAmerican1\n·\nDec 17",
        "text": "BREAKING: In a manic, shouting speech, Trump demonstrated that he still doesn't know math, as he insisted he's slashed drug prices by 600%, meaning drug companies will be paying patients.\n\nThat's not how it works, Donald.",
        "timestamp": "2025-12-19T14:01:12.554461"
    },
    {
        "handle": "@actingliketommy\n·\nDec 13",
        "text": "Either Donald Trump is also a trans-supporting leftist too, or they are reaching desperately... so, which is it?",
        "timestamp": "2025-12-19T14:01:14.869046"
    },
    {
        "handle": "@donkoclock\n·\nDec 16",
        "text": "Karoline Leavitt sold her soul for Donald Trump and paid the price.\n\nDO NOT RETWEET. \n@PressSec\n is upset about the Vanity Fair Pic.",
        "timestamp": "2025-12-19T14:01:14.883481"
    },
    {
        "handle": "@DisavowTrump20\n·\nDec 18",
        "text": "Your daily reminder that Officer Brian Sicknick would still be alive if it weren't for Donald Trump.",
        "timestamp": "2025-12-19T14:01:18.029799"
    },
    {
        "handle": "@LePapillonBlu2\n·\nDec 17",
        "text": "Donald Trump's Hollywood Walk of Fame star, once upon a time! ",
        "timestamp": "2025-12-19T14:01:18.048822"
    },
    {
        "handle": "@AesPolitics1\n·\nDec 17",
        "text": "We are going to war with Venezuela because Donald Trump is on the Epstein list.",
        "timestamp": "2025-12-19T14:01:21.079813"
    },
    {
        "handle": "@BernieSanders\n·\nDec 9",
        "text": "Donald Trump says the economy is “A+++++.”\n\nReally? \n60% of Americans live paycheck to paycheck.\n800,000 are homeless.\nFood prices are at record highs.\nWages lag behind inflation.\n\nGod help us when we have a B+++++  economy.",
        "timestamp": "2025-12-19T14:01:21.096239"
    },
    {
        "handle": "@TrumpDailyPosts\n·\nAdmin\n·\nDec 14",
        "text": "Greatest ever",
        "timestamp": "2025-12-19T14:01:21.110948"
    },
    {
        "handle": "@FurkanGozukara\n·\nDec 18",
        "text": "Protect him : Tucker Carlson exposes that Donald Trump is funding a genocide in Gaza to please his donors.\n\nThis is the intentional murder of innocent children to steal their land.",
        "timestamp": "2025-12-19T14:01:22.847697"
    },
    {
        "handle": "@WhiteHouse\n·\n34m",
        "text": " INTO LAW: President Donald J. Trump signed the NDAA for fiscal year 2026, delivering on his PEACE THROUGH STRENGTH agenda. ",
        "timestamp": "2025-12-19T14:01:22.865686"
    },
    {
        "handle": "@RedEagleUpdates\n·\n18h",
        "text": " BREAKING: Donald Trump confirms he is prepared to declare a national emergency and use the military assets to reverse the Biden invasion.\n\nDo you support this?\n\nA. YES \nB. NO",
        "timestamp": "2025-12-19T14:01:25.626525"
    },
    {
        "handle": "@glenn_tunes\n·\nJan 12",
        "text": "THIS IS NOT A LEADER... HE IS INCAPABLE OF BEHAVING LIKE A NORMAL PERSON... DONALD TRUMP IS A MENTALLY UNSTABLE ANTI AMERICAN LUNATIC THAT HATES AMERICA.... WHY WOULD ANYONE SUPPORT SUCH A HORRIBLE PERSON...",
        "timestamp": "2025-12-19T14:01:28.279816"
    },
    {
        "handle": "@FoxNews\n·\nDec 12",
        "text": "NEW: Minnesota Gov. Tim Walz takes aim at President Trump as criticism mounts over the state's widespread fraud scandal:\n\n\"When I speak up, it brings Donald Trump's petty vindictiveness to Minnesota. And this is all about coming and attacking us.\"",
        "timestamp": "2025-12-19T14:01:28.298222"
    },
    {
        "handle": "@StandUpForTrmp\n·\nDec 10",
        "text": "Imagine being 79, with 5 children, stress-free, and being this ABSOLUTELY happy. WE DID IT  \n\nThe LEFT can’t stand this.\n\nDO YOU BELIEVE DONALD TRUMP IS A GOOD MAN? \n\nA. YES \nB. NO\n\nIF YES, Give me a Thumbs-Up!!",
        "timestamp": "2025-12-19T14:01:30.712070"
    },
    {
        "handle": "@ThomasSowell\n·\n2h",
        "text": "Lawrence O'Donnell: \"No president in history released more violent felons in one day than Donald Trump on his inauguration day, when he pardoned every violent felon who attacked the Capitol on Jan 6th for him to try to overturn a presidential election!\"",
        "timestamp": "2025-12-19T14:01:30.747446"
    },
    {
        "handle": "@PopCrave\n·\n21h",
        "text": "Donald Trump announces ‘Patriot Games,’ an unprecedented four-day athletic event with “one young man and one young woman from each state and territory.”",
        "timestamp": "2025-12-19T14:01:30.764096"
    },
    {
        "handle": "@StandUpForElonn\n·\nDec 14",
        "text": " James Woods said, \"Donald Trump has been abused, degraded, lied about, and undermined from the moment he took office. He stands for this country, he stands for every American, and has stood like a lion against a pack of jackals for four years. God bless Trump.\"\n\nDo you agree?",
        "timestamp": "2025-12-19T14:01:33.412893"
    },
    {
        "handle": "@EricLDaugh\n·\nDec 13",
        "text": " JUST IN - PRESIDENT TRUMP: \"Wow! The great Art (Arthur) Laffer, Ronald Reagan’s economic “whiz,” and highly respected by all, said in a speech last night that, “Donald Trump is the greatest President in history, bar none.” Such an honor coming from a man of such wisdom. Also,",
        "timestamp": "2025-12-19T14:01:35.676228"
    },
    {
        "handle": "@dash_eats\n·\nJul 5, 2024",
        "text": "Thank you America Thank you Donald Trump",
        "timestamp": "2025-12-19T14:01:35.695141"
    },
    {
        "handle": "@MAGAVoice\n·\nDec 14",
        "text": "DONALD TRUMP JUST POSTED THE ABSOLUTE BEST PHOTO ON TRUTH: “FIGHT FIGHT FIGHT”",
        "timestamp": "2025-12-19T14:01:35.710087"
    },
    {
        "handle": "@AntiTrumpCanada\n·\nDec 15",
        "text": "Donald Trump isn’t just the worst president ever, he’s the worst American in history. He’s a malignant narcissist, a sociopath and a sadist who’s incapable of feeling empathy and cannot fake humanity. Attacking the dead is who he is.  There is no cure for this level of evil.",
        "timestamp": "2025-12-19T14:01:38.857004"
    },
    {
        "handle": "@MAGAVoice\n·\nDec 15",
        "text": "BREAKING  Donald Trump Jr just announced he is going marry his beautiful Girlfriend. I love it ",
        "timestamp": "2025-12-19T14:01:40.563142"
    },
    {
        "handle": "@WakeUpPatriott\n·\nDec 17",
        "text": "BREAKING: If Donald Trump and Elon Musk buy CNN and turn it into a truth-focused news channel with Tucker Carlson as the main host,\n\nWOULD YOU WATCH THE NEW CNN?\n\nYES or NO?",
        "timestamp": "2025-12-19T14:01:40.593527"
    },
    {
        "handle": "@krassenstein\n·\nDec 15",
        "text": "The same people who scream about “Christian values” and “respect for life” the moment it’s convenient suddenly have no problem spreading lies, mocking Rob Reiner's death, and turning human tragedy into political entertainment.\n\nDonald Trump didn’t just cross a line, he erased it.",
        "timestamp": "2025-12-19T14:01:43.618176"
    },
    {
        "handle": "@Variety\n·\nDec 15",
        "text": "Donald Trump was slammed by \"The View\" hosts for \"attacking\" Rob Reiner after his death and for suggesting Reiner died because he was anti-Trump: \"It is disgraceful.\"\n\n“For Trump to have put that out today, I’m gonna say it: You know, damn it, there’s an American family grieving.",
        "timestamp": "2025-12-19T14:01:43.681566"
    },
    {
        "handle": "@_MAGA_NEWS_\n·\nDec 16",
        "text": " ALERT: In a stunning move, American President Donald Trump has signed an executive order to stop funding migrant shelters and establish the 'National Center for Warrior Independence' by EO, which will use those funds to combat veteran homelessness and help veterans!",
        "timestamp": "2025-12-19T14:01:46.631477"
    },
    {
        "handle": "@iAnonPatriot\n·\nDec 16",
        "text": "Liberal man says he “CAN’T WAIT to celebrate the d*ath of Donald Trump, like he did with Charlie Kirk.. \n\nYou don’t hate these people enough.",
        "timestamp": "2025-12-19T14:01:46.649830"
    },
    {
        "handle": "@greendragonhq\n·\n15h",
        "text": "“To Jeff, You are are the greatest”\n\n- Donald Trump.\n\nSigned with identical signatures as the birthday letter.",
        "timestamp": "2025-12-19T14:01:48.563226"
    },
    {
        "handle": "@DisavowTrump20\n·\nDec 17",
        "text": "RETWEET if you stand with Jack Smith against Donald Trump!",
        "timestamp": "2025-12-19T14:01:48.582623"
    },
    {
        "handle": "@FoxNews\n·\nDec 14",
        "text": "'CELEBRATE PROUDLY': President Donald Trump had a message for Jewish Americans going into the Hanukkah holiday, following the deadly terror attack at Australia's Bondi Beach.",
        "timestamp": "2025-12-19T14:01:50.696492"
    },
    {
        "handle": "@DrunkRepub\n·\nDec 15",
        "text": "Conservative Twitter: “See, when a liberal dies conservatives behave like adults.”\n\nDonald Trump:",
        "timestamp": "2025-12-19T14:01:50.717271"
    },
    {
        "handle": "@elonmusk\n·\nJul 28, 2024",
        "text": "Wow, Google has a search ban on President Donald Trump! \n\nElection interference?",
        "timestamp": "2025-12-19T14:01:53.244153"
    },
    {
        "handle": "@joseantoniokast\n·\nNov 6, 2024",
        "text": "My congratulations to Donald Trump. A new triumph for freedom and common sense   \n\n@realDonaldTrump",
        "timestamp": "2025-12-19T14:01:53.259418"
    },
    {
        "handle": "@eldiariodedross\n·\nJul 13, 2024",
        "text": "They tried to kill Donald Trump. News developing.",
        "timestamp": "2025-12-19T14:01:56.320069"
    },
    {
        "handle": "@AZ_Brittney\n·\nDec 16",
        "text": "Susie Wiles told Vanity Fair that Donald Trump was on Jeffrey Epstein's plane\n\nGive me a thumbs up  if you want to see the unredacted files.",
        "timestamp": "2025-12-19T14:01:58.963203"
    },
    {
        "handle": "@itsSaulGoodman\n·\nAug 15, 2023",
        "text": "That one time I tried to help Donald Trump.",
        "timestamp": "2025-12-19T14:02:02.252126"
    },
    {
        "handle": "@RedEagleUpdates\n·\nDec 12",
        "text": "BE HONEST: \n\nDO YOU BELIEVE DONALD TRUMP IS A GOOD MAN? \n\nA. YES \nB. NO",
        "timestamp": "2025-12-19T14:02:02.375910"
    },
    {
        "handle": "@FoxNews\n·\nDec 10",
        "text": "BREAKING: Senate Republicans clear first procedural hurdle on road to confirming 97 of President Donald Trump's nominees, after changing the confirmation rules in September",
        "timestamp": "2025-12-19T14:02:04.413223"
    },
    {
        "handle": "@indyfor45th47th\n·\nDec 18",
        "text": "Would you support President Donald Trump's banning every school from teaching woke ideologies to kids?\n\nIf YES, Give me a THUMBS-UP!",
        "timestamp": "2025-12-19T14:02:04.434656"
    },
    {
        "handle": "@WSJ\n·\n4h",
        "text": "From \n@WSJopinion\n: The FBI raid on Donald Trump’s Mar-a-Lago residence was a shocking moment, the first time in history federal law-enforcement had acted against a former president. More shocking: It didn’t have to be that way, writes \n@KimStrassel\n.",
        "timestamp": "2025-12-19T14:02:04.455136"
    },
    {
        "handle": "@DemocraticWins\n·\nDec 18",
        "text": "BREAKING: Jimmy Kimmel and Kamala Harris just shared a laugh about the irony of Donald Trump’s cognitive decline after years of making fun of President Biden. This is amazing.",
        "timestamp": "2025-12-19T14:02:07.262092"
    }
]